"""
В една компания се планира изпълнението на n различни задачи. 
За даден проект е необходимо да се изберат k от тези задачи, които ще се изпълняват в строго определен ред. 
Всеки ред задачи представлява уникална подредба на задачи и има конкретен номер в лексикографската подредба на всички възможни редове.
Вашата задача е да определите поредния номер на даден ред задачи в лексикографската подредба.

Input Format

На първия ред се подава цяло число T — броят на тестовите примери (1≤T≤1000) Следват T тестови примера.
За всеки тестов пример:
Първият ред съдържа две цели числа n и k, където: n е броят на всички задачи (1≤k≤n≤10) k е броят на избраните задачи.
Вторият ред съдържа k уникални числа, които представляват реда на задачите, подредени за изпълнение.

Constraints

1≤T≤1000

1≤k≤n≤10

Output Format

За всеки тестов пример изведете на нов ред номера на подредбата в лексикографския ред, като броенето започва от 1.

Sample Input 0

2 
3 2 
1 0 
4 3 
2 1 0  
Sample Output 0

3 
15 
Explanation 0

Първи тест: Възможните подредби на {0,1,2} с k=2 в лексикографски ред са:

0 1
0 2
1 0
1 2
2 0
2 1

Номерът на подредбата 10 е 3.

Втори тест:

Възможните подредби на {0,1,2,3} с k=3 в лексикографски ред:

1) (0,1,2)
2) (0,1,3)
3) (0,2,1)
4) (0,2,3)
5) (0,3,1)
6) (0,3,2)
7) (1,0,2)
8) (1,0,3)
9) (1,2,0)
10) (1,2,3)
11) (1,3,0)
12) (1,3,2)
13) (2,0,1)
14) (2,0,3)
15) (2,1,0) <-- ето я търсената
16) (2,1,3)
17) (2,3,0)
18) (2,3,1)
19) (3,0,1)
20) (3,0,2)
21) (3,1,0)
22) (3,1,2)
23) (3,2,0)
24) (3,2,1)

Подредбата 210 е 15.
"""

from itertools import permutations

def order(n: int, k: int, numbers: list[int]) -> int:
    all_tasks = list(range(n))
    all_comb = list(permutations(all_tasks, k))
    
    return all_comb.index(tuple(numbers)) + 1

t = int(input())

cases = []
for _ in range(t):
    n, k = map(int, input().split())
    numbers = list(map(int, input().split()))
    cases.append((n, k, numbers))

for c in cases:
    print(order(*c))
    