"""
Група приятели се събират, за да изпълнят древен ритуал в кръгова формация.
Всеки от тях има своето място в кръга, но те се чудят по колко различни начина могат да се подредят,
ако всички завъртания на кръга се считат за едно и също подреждане.
Напишете програма, която да изчисли броя на възможните уникални подреждания на приятелите в кръг.

Input Format

На първия ред е зададено числото T, което представлява броя на тестовите примери.
Следват T реда, като всеки ред съдържа едно цяло число N, което представлява броя на приятелите.

Constraints

1 ≤ T ≤ 20000 (брой тестови примери)
1 ≤ N ≤ 1000000 (брой приятели)
Output Format

За всеки тест изведете броя на уникалните подреждания в кръг.

Sample Input 0

3
3
4
5
Sample Output 0

2
6
24
Explanation 0

При N = 3: Всички линейни подреждания са 3! = 6, но в кръг те са (3 - 1)! = 2. При N = 4: Всички линейни подреждания са 4! = 24,
но в кръг те са (4 - 1)! = 6. При N = 5: Всички линейни подреждания са 5! = 120, но в кръг те са (5 - 1)! = 24.
"""

import math


def combinations(n: int) -> int:
    return math.factorial(n - 1)


t = int(input())

cases = []
for _ in range(t):
    cases.append(int(input()))

for case in cases:
    print(combinations(case))
