"""
В една компания се съхраняват множество файлове с различни размери.
Компанията разполага с ограничено пространство и трябва да избере файлове с най-малки размери, които да бъдат архивирани.
Ваша задача е да напишете програма, която за всеки тестов пример намира K-те файла с най-малък размер.

Input Format

На първия ред се подава числото T — броят на тестовите примери (1≤T≤100)

За всеки тестов пример:

На първия ред се въвеждат две цели числа N и K (1≤K≤N≤1,000,000)— броят на файловете и броят на файловете, които трябва да се архивират.

На следващия ред се въвеждат N цели числа, представляващи размерите на файловете. Всички числа са в интервала [1,10^9].

Constraints

1≤T≤100

1≤K≤N≤1,000,000

Общият брой числа във всички тестови примери няма да надвишава 10^7

Output Format

За всеки тестов пример изведете K-те най-малки размера на файловете в нарастващ ред, разделени с интервали.
Всеки резултат трябва да бъде на нов ред.

Sample Input 0

2
10 4
15 3 20 10 5 1 8 12 7 6
6 2
100 200 300 10 20 5
Sample Output 0

1 3 5 6
5 10
"""


def find_min(k: int, n: int, sizes: list[int]):
    result = []
    for _ in range(n):
        result.append(min(sizes))
        sizes.remove(min(sizes))
    return result


t = int(input())

cases = []
for _ in range(t):
    k, n = map(int, input().split())
    string = list(map(int, input().split()))
    cases.append((k, n, string))

for case in cases:
    print(*find_min(*case))
