"""
В система за домашна автоматизация, сигналите за различни състояния на устройства се кодират с помощта на битови маски.
Вашата задача е да напишете програма, която по дадено число и индекс, установява n-тия бит на числото в единица, означаващ активиране на определено състояние.

Input Format

На първия ред се подава броят на тестовите примери T.
За всеки тест: Един ред съдържащ две цели числа: числото X и индекса n, където n е индексът на бита, който трябва да бъде установен в единица (броене от 0).

Constraints

1 ≤ T ≤ 100

0 ≤ X ≤ 2^31 - 1

0 ≤ n ≤ 31

Output Format

За всеки тест изведете на нов ред резултатът от операцията.

Sample Input 0

3
2 1
3 2
0 4
Sample Output 0

2
7
16
"""


def singal_state(x: int, n: int) -> int:
    return x | (1 << n)


for _ in range(int(input())):
    x, n = map(int, input().split())

    print(singal_state(x, n))
