"""
В строителен проект се използват GPS устройства за локализиране на ключови точки от терена. 
Всяка тройка точки образува триъгълник, и инженерите искат да знаят площта му. 
Задачата е да напишете програма, която изчислява площта на триъгълник, зададен от три върха в координатна система.

Input Format

На първия ред се подава числото T — броят на тестовите примери (1≤T≤1000)

За всеки тестов пример:

Един ред съдържа 6 цели числа: x1,y1,x2,y2,x3,y3​, които представляват координатите на трите върха на триъгълника.

Constraints

1≤T≤1000

−10^6≤xi,yi≤10^6

Output Format

За всеки тестов пример изведете площта на триъгълника с точност до два знака след десетичната точка.

Sample Input 0

2 
1 1 0 -5 5 -1 
2 3 4 -2 1 6
Sample Output 0

13.00 
0.50
Explanation 0

Първи тест: Триъгълник с върхове A(1,1), B(0,−5), C(5,−1) има площ 13.00

Втори тест: Триъгълник с върхове A(2,3), B(4,−2), C(1,6) има площ 0.50
"""

def calculate_area(xA: int, yA: int, xB: int, yB: int, xC:int, yC: int) -> float:
    return abs(xA * (yB - yC) + xB * (yC - yA) + xC * (yA - yB)) / 2


res = []
for _ in range(int(input())):
    xA, yA, xB, yB, xC, yC = map(int, input().split())
    res.append(f"{calculate_area(xA, yA, xB, yB, xC, yC):.2f}")

for r in res:
    print(r)