"""
Учен записва наблюденията си за различни астрономически явления всяка нощ от началото на своето изследване. 
Той иска да анализира тези наблюдения, за да идентифицира кога е наблюдавал явление, което е по-значимо от предходните. 
Значимостта на явлението се оценява с числова стойност. 
За всяка нощ, ученият иска да намери последната нощ преди текущата, в която е наблюдавал явление с по-малка значимост.

Input Format

На първия ред се подава броят на тестовите примери T. 
За всеки тест: На първия ред за всеки тест е записано едно цяло число N – брой на наблюдаваните нощи. 
На следващия ред са записани N цели числа v1,v2,...,vn значимост на явлението във всяка нощ. Числата са разделени с по един интервал.

Constraints

1≤T≤100 1≤N≤10^5 1≤vi≤10^6

Output Format

За всеки тест, на нов ред изведете N цели числа, където i-тото число е най-големият номер на нощ, по-малък от i, 
в който значимостта на явлението е била по-малка, отколкото в текущата нощ. Числата са разделени с по един интервал. 
След последното изведено число също има интервал. Ако такава нощ не съществува, да се изведе 0.

Sample Input 0

1 
5 
20 50 30 40 50 
Sample Output 0

0 1 1 3 4  
"""

def nights(n_nights: int, signifigance: list[int]) -> list[int]:
    results = []
    stack = []
    for i in range(n_nights):
        while stack and signifigance[stack[-1]] >= signifigance[i]:
            stack.pop()
        
        if stack:
            results.append(stack[-1] + 1)
        else:
            results.append(0)
        
        stack.append(i)

    return results


t = int(input())

n_nights = int(input())
signifigance = []
for _ in range(t):
    signifigance = list(map(int, input().split()))

result = nights(n_nights, signifigance)

for res in result:
    print(res, end=" ")
